Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/MKW36Z4.svd
        <register>
          <name>PCR2</name>
          <description>Pin Control Register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS</name>
              <description>Pull Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Internal pulldown resistor is enabled on the corresponding pin, if the corresponding PE field is set.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Internal pullup resistor is enabled on the corresponding pin, if the corresponding PE field is set.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PE</name>
              <description>Pull Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRE</name>
              <description>Slew Rate Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Fast slew rate is configured on the corresponding pin, if the pin is configured as a digital output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Slow slew rate is configured on the corresponding pin, if the pin is configured as a digital output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX</name>
              <description>Pin Mux Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>Pin disabled (Alternative 0) (analog).</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>Alternative 1 (GPIO).</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>Alternative 2 (chip-specific).</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>Alternative 3 (chip-specific).</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>Alternative 4 (chip-specific).</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>Alternative 5 (chip-specific).</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>Alternative 6 (chip-specific).</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>Alternative 7 (chip-specific).</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Alternative 8 (chip-specific).</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>Alternative 9 (chip-specific).</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>Alternative 10 (chip-specific).</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Alternative 11 (chip-specific).</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Alternative 12 (chip-specific).</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>Alternative 13 (chip-specific).</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Alternative 14 (chip-specific).</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>Alternative 15 (chip-specific).</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQC</name>
              <description>Interrupt Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Interrupt Status Flag (ISF) is disabled.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>ISF flag and DMA request on rising edge.</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>ISF flag and DMA request on falling edge.</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>ISF flag and DMA request on either edge.</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>ISF flag and Interrupt when logic 0.</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>ISF flag and Interrupt on rising-edge.</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>ISF flag and Interrupt on falling-edge.</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>ISF flag and Interrupt on either edge.</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>ISF flag and Interrupt when logic 1.</description>
                  <value>#1100</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISF</name>
              <description>Interrupt Status Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Configured interrupt is not detected.</description>
                  <value>#0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR16</name>
          <description>Pin Control Register 16</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS</name>
              <description>Pull Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Internal pulldown resistor is enabled on the corresponding pin, if the corresponding PE field is set.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Internal pullup resistor is enabled on the corresponding pin, if the corresponding PE field is set.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PE</name>
              <description>Pull Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRE</name>
              <description>Slew Rate Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Fast slew rate is configured on the corresponding pin, if the pin is configured as a digital output.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Slow slew rate is configured on the corresponding pin, if the pin is configured as a digital output.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX</name>
              <description>Pin Mux Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>Pin disabled (Alternative 0) (analog).</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>Alternative 1 (GPIO).</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>Alternative 2 (chip-specific).</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>Alternative 3 (chip-specific).</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>Alternative 4 (chip-specific).</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>Alternative 5 (chip-specific).</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>Alternative 6 (chip-specific).</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>Alternative 7 (chip-specific).</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Alternative 8 (chip-specific).</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>Alternative 9 (chip-specific).</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>Alternative 10 (chip-specific).</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Alternative 11 (chip-specific).</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Alternative 12 (chip-specific).</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>Alternative 13 (chip-specific).</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Alternative 14 (chip-specific).</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>Alternative 15 (chip-specific).</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQC</name>
              <description>Interrupt Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Interrupt Status Flag (ISF) is disabled.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>ISF flag and DMA request on rising edge.</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>ISF flag and DMA request on falling edge.</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>ISF flag and DMA request on either edge.</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>ISF flag and Interrupt when logic 0.</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>ISF flag and Interrupt on rising-edge.</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>ISF flag and Interrupt on falling-edge.</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>ISF flag and Interrupt on either edge.</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>ISF flag and Interrupt when logic 1.</description>
                  <value>#1100</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISF</name>
              <description>Interrupt Status Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Configured interrupt is not detected.</description>
                  <value>#0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
