Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/MKW36Z4.svd
        <register>
          <name>GEN_SLEEP</name>
          <description>Generic FSK Link Layer Sleep Time</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEN_SLEEP_TIME</name>
              <description>Generic FSK Link Layer Sleep Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GEN_WAKE</name>
          <description>Generic FSK Link Layer Wake Time</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEN_WAKE_TIME</name>
              <description>Generic FSK Link Layer Wake Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_OSC_CTRL</name>
          <description>Radio Oscillator Control</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA0203806</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_XTAL_ALC_COUNT_SEL</name>
              <description>rmap_bb_xtal_alc_count_sel_hv[1:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>2048 (64 us @ 32 MHz)</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>4096 (128 us @ 32 MHz)</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>8192 (256 us @ 32 MHz)</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>16384 (512 us @ 32 MHz)</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_XTAL_ALC_ON</name>
              <description>rmap_bb_xtal_alc_on_hv</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_OSC_BYPASS_EN</name>
              <description>RF Ref Osc Bypass Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_COMP_BIAS</name>
              <description>rmap_bb_xtal_comp_bias_hv[4:0]</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_DC_COUP_MODE_EN</name>
              <description>rmap_bb_xtal_dc_coup_mode_en_hv</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_DIAGSEL</name>
              <description>rmap_bb_xtal_diagsel_hv</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_DIG_CLK_ON</name>
              <description>rmap_bb_xtal_dig_clk_on_hv</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_GM</name>
              <description>rmap_bb_xtal_gm_hv[4:0]</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_ON_OVRD</name>
              <description>rmap_bb_xtal_on_ovrd_hv</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_ON_OVRD_ON</name>
              <description>rmap_bb_xtal_on_ovrd_on_hv</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>rfctrl_bb_xtal_on_hv is asserted</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>rfctrl_bb_xtal_on_ovrd_hv is asserted</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_XTAL_READY_COUNT_SEL</name>
              <description>rmap_bb_xtal_ready_count_sel_hv[1:0]</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1024 counts (32 us @ 32 MHz)</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>2048 (64 us @ 32 MHz)</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>4096 (128 us @ 32 MHz)</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>8192 (256 us @ 32 MHz)</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RADIO_EXT_OSC_RF_EN_SEL</name>
              <description>Radio External Request for RF OSC Select</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_EXT_OSC_OVRD</name>
              <description>Radio External Request for RF OSC Override</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_EXT_OSC_OVRD_EN</name>
              <description>Radio External Request for RF OSC Override Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_NOT_ALLOWED_OVRD</name>
              <description>RF Not Allowed Override</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_NOT_ALLOWED_OVRD_EN</name>
              <description>RF Not Allowed Override Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANA_TEST</name>
          <description>Radio Analog Test Registers</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XTAL_OUT_BUF_EN</name>
              <description>XTAL Output Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANA_TRIM</name>
          <description>Radio Analog Trim Registers</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x784B0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_LS_SPARE</name>
              <description>rmap_bb_ldo_ls_spare_hv[1:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_LS_TRIM</name>
              <description>rmap_bb_ldo_ls_trim_hv[2:0]</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1.20 V (Default)</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1.25 V</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>1.28 V</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>1.33 V</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>1.40 V</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>1.44 V</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>1.50 V</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>1.66 V</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_LDO_XO_SPARE</name>
              <description>rmap_bb_ldo_xo_spare_hv[1:0]</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_XO_TRIM</name>
              <description>rmap_bb_ldo_xo_trim_hv[2:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1.20 V (Default)</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1.25 V</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>1.28 V</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>1.33 V</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>1.40 V</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>1.44 V</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>1.50 V</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>1.66 V</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_XTAL_SPARE</name>
              <description>rmap_bb_xtal_spare_hv[4:0]</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_TRIM</name>
              <description>rmap_bb_xtal_trim_hv[7:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BG_1V_TRIM</name>
              <description>rmap_bg_1v_trim_hv[3:0]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>954.14 mV</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>959.26 mV</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>964.38 mV</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>969.5 mV</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>974.6 mV</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>979.7 mV</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>984.8 mV</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>989.9 mV</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>995 mV (Default)</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>1 V</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>1.005 V</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>1.01 V</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>1.015 V</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>1.02 V</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>1.025 V</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>1.031 V</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BG_IBIAS_5U_TRIM</name>
              <description>rmap_bg_ibias_5u_trim_hv[3:0]</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>3.55 uA</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>3.73 uA</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>4.04 uA</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>4.22 uA</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4.39 uA</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>4.57 uA</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>4.89 uA</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>5.06 (Default)</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>5.23 uA</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>5.41 uA</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>5.72 uA</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>5.9 uA</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>6.07 uA</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>6.25 uA</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>6.56 uA</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>6.74 uA</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
