Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/MKW36Z4.svd
        <register>
          <name>TIMING00</name>
          <description>TSM_TIMING00</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_HF_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_HF_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_HF_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_HF_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_HF_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_HF_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_HF_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_HF_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING01</name>
          <description>TSM_TIMING01</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_ADCDAC_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_ADCDAC_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_ADCDAC_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_ADCDAC_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_ADCDAC_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_ADCDAC_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_ADCDAC_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_ADCDAC_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING02</name>
          <description>TSM_TIMING02</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6700FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_BBA_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_BBA_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_BBA_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_BBA_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING03</name>
          <description>TSM_TIMING03</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_PD_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_PD_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_PD_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_PD_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_PD_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_PD_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_PD_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_PD_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING04</name>
          <description>TSM_TIMING04</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_FDBK_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_FDBK_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_FDBK_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_FDBK_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_FDBK_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_FDBK_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_FDBK_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_FDBK_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING05</name>
          <description>TSM_TIMING05</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_VCOLO_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_VCOLO_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_VCOLO_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_VCOLO_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_VCOLO_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING06</name>
          <description>TSM_TIMING06</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_VTREF_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_VTREF_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VTREF_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_VTREF_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VTREF_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_VTREF_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VTREF_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_VTREF_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING07</name>
          <description>TSM_TIMING07</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5000500</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_FDBK_BLEED_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_FDBK_BLEED_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_FDBK_BLEED_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_FDBK_BLEED_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_FDBK_BLEED_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_FDBK_BLEED_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_FDBK_BLEED_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_FDBK_BLEED_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING08</name>
          <description>TSM_TIMING08</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3000300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_VCOLO_BLEED_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_VCOLO_BLEED_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_BLEED_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_VCOLO_BLEED_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_BLEED_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_VCOLO_BLEED_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_BLEED_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_VCOLO_BLEED_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING09</name>
          <description>TSM_TIMING09</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3000300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_VCOLO_FASTCHARGE_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_VCOLO_FASTCHARGE_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_FASTCHARGE_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_VCOLO_FASTCHARGE_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_FASTCHARGE_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_VCOLO_FASTCHARGE_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_FASTCHARGE_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_VCOLO_FASTCHARGE_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING10</name>
          <description>TSM_TIMING10</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67036A03</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_XTAL_PLL_REF_CLK_EN_TX_HI</name>
              <description>Assertion time setting for BB_XTAL_PLL_REF_CLK_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_PLL_REF_CLK_EN_TX_LO</name>
              <description>De-assertion time setting for BB_XTAL_PLL_REF_CLK_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_PLL_REF_CLK_EN_RX_HI</name>
              <description>Assertion time setting for BB_XTAL_PLL_REF_CLK_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_PLL_REF_CLK_EN_RX_LO</name>
              <description>De-assertion time setting for BB_XTAL_PLL_REF_CLK_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING11</name>
          <description>TSM_TIMING11</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF6A03</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_XTAL_DAC_REF_CLK_EN_TX_HI</name>
              <description>Assertion time setting for BB_XTAL_DAC_REF_CLK_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_DAC_REF_CLK_EN_TX_LO</name>
              <description>De-assertion time setting for BB_XTAL_DAC_REF_CLK_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING12</name>
          <description>TSM_TIMING12</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6703FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_VCO_REF_CLK_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_VCO_REF_CLK_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_VCO_REF_CLK_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_VCO_REF_CLK_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING13</name>
          <description>TSM_TIMING13</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x16004A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_LOOP_IS_OPEN_TX_HI</name>
              <description>Assertion time setting for PLL_LOOP_IS_OPEN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_LOOP_IS_OPEN_TX_LO</name>
              <description>De-assertion time setting for PLL_LOOP_IS_OPEN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_LOOP_IS_OPEN_RX_HI</name>
              <description>Assertion time setting for PLL_LOOP_IS_OPEN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_LOOP_IS_OPEN_RX_LO</name>
              <description>De-assertion time setting for PLL_LOOP_IS_OPEN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING14</name>
          <description>TSM_TIMING14</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x672F645F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SY_PD_CYCLE_SLIP_LD_FT_EN_TX_HI</name>
              <description>Assertion time setting for SY_PD_CYCLE_SLIP_LD_FT_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_PD_CYCLE_SLIP_LD_FT_EN_TX_LO</name>
              <description>De-assertion time setting for SY_PD_CYCLE_SLIP_LD_FT_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_PD_CYCLE_SLIP_LD_FT_EN_RX_HI</name>
              <description>Assertion time setting for SY_PD_CYCLE_SLIP_LD_FT_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_PD_CYCLE_SLIP_LD_FT_EN_RX_LO</name>
              <description>De-assertion time setting for SY_PD_CYCLE_SLIP_LD_FT_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING15</name>
          <description>TSM_TIMING15</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67036A03</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SY_VCO_EN_TX_HI</name>
              <description>Assertion time setting for SY_VCO_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_VCO_EN_TX_LO</name>
              <description>De-assertion time setting for SY_VCO_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_VCO_EN_RX_HI</name>
              <description>Assertion time setting for SY_VCO_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_VCO_EN_RX_LO</name>
              <description>De-assertion time setting for SY_VCO_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
