Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/MKW36Z4.svd
        <register>
          <name>TIMING54</name>
          <description>TSM_TIMING54</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1504FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING55</name>
          <description>TSM_TIMING55</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x671EFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_ADC_BUF_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_ADC_BUF_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_ADC_BUF_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_ADC_BUF_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING56</name>
          <description>TSM_TIMING56</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x671EFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_DIG_BUF_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_DIG_BUF_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_DIG_BUF_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_DIG_BUF_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING57</name>
          <description>TSM_TIMING57</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1A03FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_RCCAL_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_RCCAL_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_RCCAL_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_RCCAL_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING58</name>
          <description>TSM_TIMING58</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF6A03</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_HPM_DAC_EN_TX_HI</name>
              <description>Assertion time setting for TX_HPM_DAC_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_HPM_DAC_EN_TX_LO</name>
              <description>De-assertion time setting for TX_HPM_DAC_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRD0</name>
          <description>TSM OVERRIDE REGISTER 0</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_HF_EN_OVRD_EN</name>
              <description>Override control for BB_LDO_HF_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of BB_LDO_HF_EN_OVRD to override the signal &quot;bb_ldo_hf_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_LDO_HF_EN_OVRD</name>
              <description>Override value for BB_LDO_HF_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_ADCDAC_EN_OVRD_EN</name>
              <description>Override control for BB_LDO_ADCDAC_EN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of BB_LDO_ADCDAC_EN_OVRD to override the signal &quot;bb_ldo_adcdac_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_LDO_ADCDAC_EN_OVRD</name>
              <description>Override value for BB_LDO_ADCDAC_EN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_BBA_EN_OVRD_EN</name>
              <description>Override control for BB_LDO_BBA_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of BB_LDO_BBA_EN_OVRD to override the signal &quot;bb_ldo_bba_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_LDO_BBA_EN_OVRD</name>
              <description>Override value for BB_LDO_BBA_EN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_PD_EN_OVRD_EN</name>
              <description>Override control for BB_LDO_PD_EN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of BB_LDO_PD_EN_OVRD to override the signal &quot;bb_ldo_pd_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_LDO_PD_EN_OVRD</name>
              <description>Override value for BB_LDO_PD_EN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_FDBK_EN_OVRD_EN</name>
              <description>Override control for BB_LDO_FDBK_EN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of BB_LDO_FDBK_EN_OVRD to override the signal &quot;bb_ldo_fdbk_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_LDO_FDBK_EN_OVRD</name>
              <description>Override value for BB_LDO_FDBK_EN</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_EN_OVRD_EN</name>
              <description>Override control for BB_LDO_VCOLO_EN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of BB_LDO_VCOLO_EN_OVRD to override the signal &quot;bb_ldo_vcolo_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_LDO_VCOLO_EN_OVRD</name>
              <description>Override value for BB_LDO_VCOLO_EN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VTREF_EN_OVRD_EN</name>
              <description>Override control for BB_LDO_VTREF_EN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of BB_LDO_VTREF_EN_OVRD to override the signal &quot;bb_ldo_vtref_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_LDO_VTREF_EN_OVRD</name>
              <description>Override value for BB_LDO_VTREF_EN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_FDBK_BLEED_EN_OVRD_EN</name>
              <description>Override control for BB_LDO_FDBK_BLEED_EN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of BB_LDO_FDBK_BLEED_EN_OVRD to override the signal &quot;bb_ldo_fdbk_bleed_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_LDO_FDBK_BLEED_EN_OVRD</name>
              <description>Override value for BB_LDO_FDBK_BLEED_EN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_BLEED_EN_OVRD_EN</name>
              <description>Override control for BB_LDO_VCOLO_BLEED_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of BB_LDO_VCOLO_BLEED_EN_OVRD to override the signal &quot;bb_ldo_vcolo_bleed_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_LDO_VCOLO_BLEED_EN_OVRD</name>
              <description>Override value for BB_LDO_VCOLO_BLEED_EN</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_FASTCHARGE_EN_OVRD_EN</name>
              <description>Override control for BB_LDO_VCOLO_FASTCHARGE_EN</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of BB_LDO_VCOLO_FASTCHARGE_EN_OVRD to override the signal &quot;bb_ldo_vcolo_fastcharge_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_LDO_VCOLO_FASTCHARGE_EN_OVRD</name>
              <description>Override value for BB_LDO_VCOLO_FASTCHARGE_EN</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_PLL_REF_CLK_EN_OVRD_EN</name>
              <description>Override control for BB_XTAL_PLL_REF_CLK_EN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of BB_XTAL_PLL_REF_CLK_EN_OVRD to override the signal &quot;bb_xtal_pll_ref_clk_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_XTAL_PLL_REF_CLK_EN_OVRD</name>
              <description>Override value for BB_XTAL_PLL_REF_CLK_EN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_DAC_REF_CLK_EN_OVRD_EN</name>
              <description>Override control for BB_XTAL_DAC_REF_CLK_EN</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of BB_XTAL_DAC_REF_CLK_EN_OVRD to override the signal &quot;bb_xtal_dac_ref_clk_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_XTAL_DAC_REF_CLK_EN_OVRD</name>
              <description>Override value for BB_XTAL_DAC_REF_CLK_EN</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_AUXPLL_REF_CLK_EN_OVRD_EN</name>
              <description>Override control for BB_XTAL_AUXPLL_REF_CLK_EN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of BB_XTAL_AUXPLL_REF_CLK_EN_OVRD to override the signal &quot;bb_xtal_auxpll_ref_clk_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB_XTAL_AUXPLL_REF_CLK_EN_OVRD</name>
              <description>Override value for BB_XTAL_AUXPLL_REF_CLK_EN</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_LOOP_IS_OPEN_OVRD_EN</name>
              <description>Override control for PLL_LOOP_IS_OPEN</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of PLL_LOOP_IS_OPEN_OVRD to override the signal &quot;pll_loop_is_open&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_LOOP_IS_OPEN_OVRD</name>
              <description>Override value for PLL_LOOP_IS_OPEN</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_PD_CYCLE_SLIP_LD_EN_OVRD_EN</name>
              <description>Override control for SY_PD_CYCLE_SLIP_LD_EN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of SY_PD_CYCLE_SLIP_LD_EN_OVRD to override the signal &quot;sy_pd_cycle_slip_ld_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SY_PD_CYCLE_SLIP_LD_EN_OVRD</name>
              <description>Override value for SY_PD_CYCLE_SLIP_LD_EN</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SY_VCO_EN_OVRD_EN</name>
              <description>Override control for SY_VCO_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of SY_VCO_EN_OVRD to override the signal &quot;sy_vco_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SY_VCO_EN_OVRD</name>
              <description>Override value for SY_VCO_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
