Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/MKW36Z4.svd
        <register>
          <name>PACKET_BUFFER_206</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x89C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_207</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x89E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_208</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8A0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_209</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8A2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_210</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8A4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_211</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8A6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_212</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8A8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_213</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8AA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_214</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8AC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_215</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8AE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_216</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8B0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_217</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8B2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_218</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8B4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_219</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8B6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_220</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8B8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_221</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8BA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_222</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8BC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_223</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8BE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_224</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8C0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_225</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8C2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_226</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8C4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_227</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8C6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_228</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8C8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_229</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8CA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_230</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8CC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_231</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8CE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_232</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8D0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_233</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8D2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_234</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8D4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_235</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8D6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_236</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8D8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_237</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8DA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_238</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8DC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_239</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8DE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_240</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8E0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_241</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8E2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_242</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8E4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_243</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0x8E6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
