Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/MKW36Z4.svd
        <register>
          <name>PACKET_BUFFER_662</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC2C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_663</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC2E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_664</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC30</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_665</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC32</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_666</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_667</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC36</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_668</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC38</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_669</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC3A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_670</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC3C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_671</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC3E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_672</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC40</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_673</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC42</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_674</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC44</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_675</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC46</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_676</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC48</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_677</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC4A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_678</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC4C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_679</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC4E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_680</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_681</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC52</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_682</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC54</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_683</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC56</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_684</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC58</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_685</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC5A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_686</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC5C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_687</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC5E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_688</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC60</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_689</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC62</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_690</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC64</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_691</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC66</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_692</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC68</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_693</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC6A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_694</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC6C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_695</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC6E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_696</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC70</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_697</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC72</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_698</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC74</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_699</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC76</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
