Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/MKW36Z4.svd
        <register>
          <name>PACKET_BUFFER_700</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC78</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_701</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC7A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_702</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC7C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_703</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC7E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_704</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC80</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_705</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC82</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_706</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC84</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_707</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC86</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_708</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC88</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_709</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC8A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_710</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC8C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_711</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC8E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_712</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC90</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_713</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC92</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_714</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC94</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_715</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC96</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_716</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC98</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_717</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC9A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_718</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC9C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_719</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xC9E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_720</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCA0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_721</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCA2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_722</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCA4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_723</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCA6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_724</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCA8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_725</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCAA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_726</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCAC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_727</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCAE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_728</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCB0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_729</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCB2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_730</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCB4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_731</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCB6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_732</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCB8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_733</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCBA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_734</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCBC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_735</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCBE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_736</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCC0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_737</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCC2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
