Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/MKW36Z4.svd
        <register>
          <name>PACKET_BUFFER_738</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCC4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_739</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCC6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_740</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCC8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_741</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCCA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_742</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCCC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_743</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCCE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_744</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCD0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_745</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCD2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_746</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCD4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_747</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCD6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_748</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCD8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_749</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCDA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_750</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCDC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_751</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCDE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_752</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCE0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_753</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCE2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_754</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCE4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_755</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCE6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_756</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCE8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_757</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCEA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_758</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCEC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_759</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCEE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_760</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCF0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_761</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCF2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_762</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCF4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_763</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCF6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_764</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCF8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_765</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCFA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_766</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCFC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_767</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xCFE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_768</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xD00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_769</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xD02</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_770</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xD04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_771</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xD06</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_772</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xD08</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_773</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xD0A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_774</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xD0C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_BUFFER_775</name>
          <description>PACKET BUFFER</description>
          <addressOffset>0xD0E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PACKET_BUFFER</name>
              <description>PACKET BUFFER RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
